# https://drive.google.com/file/d/1e-yXHpzB9L9aQxGtCzd9cPvw9vSFxcrm/view?usp=sharing


a = 1;
b = 2;
c = 3;
d = 4;
e = 5;
f = 6;
g = 7;
h = 8;
i = 9;
j = 10;
k = 11;
l = 12;
m = 13;
n = 14;
o = 15;
p = 16;
q = 17;
r = 18;
s = 19;
t = 20;
u = 21;
v = 22;
w = 23;
x = 24;
y = 25;
z = 26;

var = int(input('Ввод данных: Для выявления принадлежности любой буквы'
                ' к числу, введите любое число от 1 до 26: '))
if var == a:
    print('Под данным номером расположена буква: a')
elif var == b:
    print('Под данным номером расположена буква: b')
elif var == c:
    print('Под данным номером расположена буква: c')
elif var == d:
    print('Под данным номером расположена буква: d')
elif var == e:
    print('Под данным номером расположена буква: e')
elif var == f:
    print('Под данным номером расположена буква: f')
elif var == g:
    print('Под данным номером расположена буква: g')
elif var == h:
    print('Под данным номером расположена буква: h')
elif var == i:
    print('Под данным номером расположена буква: i')
elif var == j:
    print('Под данным номером расположена буква: j')
elif var == k:
    print('Под данным номером расположена буква: k')
elif var == l:
    print('Под данным номером расположена буква: l')
elif var == m:
    print('Под данным номером расположена буква: m')
elif var == n:
    print('Под данным номером расположена буква: n')
elif var == o:
    print('Под данным номером расположена буква: o')
elif var == p:
    print('Под данным номером расположена буква: p')
elif var == q:
    print('Под данным номером расположена буква: q')
elif var == r:
    print('Под данным номером расположена буква: r')
elif var == s:
    print('Под данным номером расположена буква: s')
elif var == t:
    print('Под данным номером расположена буква: t')
elif var == u:
    print('Под данным номером расположена буква: u')
elif var == v:
    print('Под данным номером расположена буква: v')
elif var == w:
    print('Под данным номером расположена буква: w')
elif var == x:
    print('Под данным номером расположена буква: x')
elif var == y:
    print('Под данным номером расположена буква: y')
else:
    print('Под данным номером расположена буква: z')